Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: However, the script would then have no way to call the original function.
ja: しかし、その場合、スクリプトは元の関数を呼び出す方法がなくなります。

source: However, the system default settings will probably cause it to activate in most cases.
ja: しかし、システムのデフォルト設定では、おそらくほとんどの場合、有効になってしまうだろう。

source: However, the use of ↑, →, ↓, ←, PgUp, PgDn, Home, and End to navigate within an editor will cause the hotstring recognition process to reset.
ja: ただし、エディター内での移動に↑、→、↓、←、PgUp、PgDn、Home、Endを使用すると、ホットストリングの認識処理がリセットされます。

source: However, the use of optional parameters is not recommended as future versions of the program may extend an event with additional parameters, in which case the optional parameters would stop receiving their default values.
ja: しかし、オプションのパラメータを使用することは推奨されません。プログラムの将来のバージョンでは、追加のパラメータでイベントを拡張する可能性があり、その場合、オプションのパラメータはデフォルト値を受け取らなくなります。

source: However, there may be cases where doing so enhances the readability or maintainability of the script.
ja: しかし、そうすることでスクリプトの読みやすさや保守性が向上する場合もあります。

source: However, there usually must be a matching ) on the same line, otherwise the line would be interpreted as the start of a continuation section.
ja: しかし、通常、同じ行に一致する)がなければ、その行は継続セクションの開始と解釈されます。

source: However, these are not functions; for instance, x := return(y) is not valid.
ja: しかし、これらは関数ではないので、例えば、x := return(y)は無効です。

source: However, these are usually only useful in combination with data structures and the DllCall function.
ja: しかし、これらは通常、データ構造やDllCall関数との組み合わせでのみ有効です。

source: However, they usually also work for other game controllers such as gamepads or steering wheels.
ja: しかし、通常はゲームパッドやステアリングホイールなど、他のゲームコントローラーにも使用できます。

source: However, this applies only to data characters; whitespace may never appear within special character sequences such as (?(, which begins a conditional subpattern.
ja: ただし、これはデータ文字にのみ適用され、条件付きサブパターンを開始する「(?(」、のような特殊文字列の中に空白が現れることはない。

source: However, this cannot be combined with the accent (`) option.
ja: ただし、アクセント(`)オプションとの併用はできない。

source: However, this does not typically occur while the window is visible, as Show automatically increments the reference count.
ja: ただし、ウィンドウが表示されている間は、Showが自動的に参照カウントを増加させるため、通常は発生しません。

source: However, this is generally not needed for the SendInput/Play modes because they automatically postpone the user's physical mouse activity until afterward.
ja: ただし、SendInput/Playモードでは、ユーザーの物理的なマウス操作を自動的に後回しにするため、一般にこの操作は必要ありません。

source: However, this is generally not needed for the SendInput and SendPlay modes because they automatically postpone the user's physical mouse activity until afterward.
ja: ただし、SendInputと SendPlayモードでは、ユーザーの物理的なマウス操作を自動的に後回しにするため、一般にこの操作は必要ありません。

source: However, this is not a function and cannot be used mid-expression.
ja: ただし、これは関数ではないので、式の途中で使用することはできません。

source: However, this is not completely effective when the function is called indirectly via the arrival of a message less than 0x0312 (increasing Critical's interval may help).
ja: ただし、0x0312未満のメッセージの到着を経由して間接的にこの関数が呼び出された場合には、完全には効果がありません（Criticalの間隔を広げると効果があるかもしれません）。

source: However, this is not necessary if the script will soon be exiting because all ImageLists are automatically destroyed at that time.
ja: しかし、スクリプトがすぐに終了する場合は、その時点ですべてのImageListsが自動的に破棄されるため、この必要はありません。

source: However, this is not supported by all applications.
ja: ただし、すべてのアプリケーションで対応しているわけではありません。

source: However, this is technically a function call statement.)
ja: ただし、これは厳密には関数呼び出し文である。)

source: However, this is usually not a concern because when using Gui.Submit or when retrieving this value this translation will be reversed automatically by replacing CR+LF with LF (`n).
ja: しかし、Gui.Submitを使用する際や、この値を取得する際には、CR+LFをLF（`n）に置き換えることで、この変換は自動的に逆転するので、通常は気にする必要はありません。

source: However, this method might not work for all types of windows and controls.
ja: ただし、この方法は、すべての種類のウィンドウやコントロールに有効とは限りません。

source: However, this new object initially has no Call method as it is not a subclass of Object.
ja: しかし、この新しいオブジェクトは、Objectのサブクラスではないため、当初はCallメソッドを持ちません。

source: However, this only applies when Keys begins with {Text} or {Blind}{Text}.
ja: ただし、Keysが {Text}または{Blind}{Text}で始まる場合のみ適用されます。

source: However, this only occurs if the wrapper object has the F_OWNVALUE flag, which indicates it is responsible for destroying the array.
ja: ただし、これはラッパーオブジェクトがF_OWNVALUEフラグを持ち、そのフラグが配列を破壊する責任があることを示している場合にのみ発生します。

source: However, this only works from a 32-bit process on a 64-bit system, so must be done conditionally.
ja: ただし、これは64ビットシステム上の32ビットプロセスからしか動作しないので、条件付きで行う必要があります。

source: However, this prevents the appearance of a "make new folder" button.
ja: ただし、これによって「新しいフォルダを作る」ボタンが表示されなくなります。

source: However, this process is based on observation, trial and error, so might not be 100 % accurate.
ja: ただし、このプロセスは観察、試行錯誤に基づいているため、100％正確とは限らない。

source: However, this translation reduces performance and is usually not necessary.
ja: しかし、この翻訳はパフォーマンスを低下させるので、通常は必要ありません。

source: However, this will also buffer/defer other threads (such as the press of a hotkey) that occur while the OnClipboardChange thread is running.
ja: ただし、この場合、OnClipboardChangeスレッドの実行中に発生する他のスレッド（ホットキーの押下など）もバッファリング/ディファーされます。

source: However, turning it on may be useful if you wish to work with hidden windows directly without first using WinShow to unhide them.
ja: ただし、WinShowで非表示を解除することなく、直接非表示のウィンドウを操作したい場合は、この機能をオンにすると便利です。

source: However, two dots are required to match a CRLF newline sequence (`r`n), not one.
ja: ただし、CRLF改行シーケンス（`r`n）にマッチさせるには、1つではなく2つのドットが必要である。

source: However, unlike Thread Interrupt, the thread becomes critical again after the user dismisses the dialog.
ja: しかし、Thread Interruptとは異なり、ユーザーがダイアログを解除した後、スレッドは再びクリティカルになる。

source: However, unlike Thread Interrupt, the thread becomes critical (and therefore uninterruptible) again after the user dismisses the dialog.
ja: しかし、スレッド割り込みとは異なり、ユーザーがダイアログを解除した後、スレッドは再びクリティカルになる（つまり割り込み不可能になる）。

source: However, unlike the SI option, SendEvent is used instead of SendPlay when SendInput is unavailable.
ja: ただし、SIオプションとは異なり、SendInputが利用できない場合はSendPlayの代わりにSendEventが使用されます。

source: However, unlike v1, properties created by a class method definition (or built-in method) are read-only by default.
ja: ただし、v1とは異なり、クラスメソッド定義（または組み込みメソッド）で作成されたプロパティは、デフォルトで読み取り専用となります。

source: However, uppercase non-ASCII characters such as 'Ä' are not considered equal to their lowercase counterparts, regardless of the current user's locale.
ja: ただし、'Ä'などの大文字の非ASCII文字は、現在のユーザーのロケールに関係なく、小文字の対応する文字と同等とはみなされない。

source: However, use caution when creating more than 5000 controls because system instability may occur for certain control types.
ja: ただし、コントロールの種類によってはシステムが不安定になる可能性があるため、5000個以上のコントロールを作成する場合は注意してください。

source: However, usually one must also specify the target window.
ja: ただし、通常はターゲットウィンドウも指定する必要があります。

source: However, variables cannot be used inside a quoted string.
ja: ただし、引用符で囲まれた文字列の中では、変数を使用することができない。

source: However, what the function receives is not a reference to the string, but a reference to the variable.
ja: しかし、関数が受け取るのは、文字列への参照ではなく、変数への参照です。

source: However, when Send or SendInput reverts to SendEvent, it is able to activate the script's own hotkeys.
ja: しかし、SendやSendInputがSendEventに戻ると、スクリプト自身のホットキーを有効にすることができます。

source: However, when SendInput reverts to SendEvent under the conditions described below, it uses SetKeyDelay -1, 0 (unless SendEvent's KeyDelay is -1,-1, in which case -1,-1 is used).
ja: ただし、後述の条件でSendInputがSendEventに戻る場合は、SetKeyDelay -1, 0 を使用します（SendEventのKeyDelayが -1,-1 の場合は -1,-1 を使用します）。

source: However, when an option is removed by key name and that name is handled by VK, the option is also removed for the corresponding SC (according to the script's keyboard layout).
ja: ただし、キー名でオプションが削除され、そのキー名がVKで扱われる場合、対応するSCについてもオプションが削除されます（スクリプトのキーボードレイアウトに準じます）。

source: However, when the control's content is retrieved via MyGui.Submit or GuiCtrl.Value, each `r`n in the text is always translated to a plain linefeed (`n).
ja: しかし、MyGui.Submitや GuiCtrl.Valueでコントロールの内容を取得する場合、テキスト内の各`r`nは常にプレーンなラインフィード（`n）に変換されます。

source: However, you can use GetKeyState to mimic this effect as shown in the following example:
ja: しかし、次の例に示すように、GetKeyStateを使用して、この効果を模倣することができます：

source: However:
ja: 但し：

source: I can't edit my script via tray icon because it won't start due to an error.
ja: エラーで起動しないので、トレイアイコンからスクリプトを編集できません。

source: I hope you have learned something.
ja: 何か学んでいただけただろうか。

source: I made it to help me to learn to touch-type (to get used to not looking at the keyboard).
ja: タッチタイピングを覚えるために（キーボードを見ないことに慣れるために）作ったんだ。

source: I'm having trouble getting my mouse buttons working as hotkeys.
ja: マウスのボタンがホットキーとして機能しないので困っています。

source: I'm using WinXP Pro (SP1) ... if you use a different OS then your params may change (only applicable to apps like Wordpad and Notepad that come with windows; for others the params shouldn't vary):
ja: 私はWinXP Pro (SP1)を使っています...もし違うOSを使っているなら、パラメータが変わるかもしれません（ワードパッドやメモ帳のようなウィンドウズ付属のアプリにのみ適用されます：）

source: I've had mixed luck with VB and Delphi apps.
ja: VBとDelphiのアプリには、いろいろな運があった。

source: I've upgraded my computer/Windows and now my script won't work.
ja: コンピュータやWindowsをアップグレードしたら、スクリプトが動かなくなった。

source: ICO, CUR, ANI, EXE, DLL, CPL, SCR, and other types that contain icon resources.
ja: ICO、CUR、ANI、EXE、DLL、CPL、SCRなど、アイコンリソースを含むタイプ。

source: IconNumber := 0 ; Flag it as not found so that these types can each have a unique icon.
ja: IconNumber := 0 ;これらの型がそれぞれユニークなアイコンを持つことができるように、見つからないというフラグを立てる。

source: IconNumber := 9999999 ; Set it out of bounds to display a blank icon.
ja: IconNumber := 9999999 ; 圏外に設定すると、空白のアイコンが表示されます。

source: IconView := not IconView ; Invert in preparation for next time.
ja: IconView := not IconView ; 次回に備え、反転させる。

source: Icons added to the list are scaled automatically to conform to the system's dimensions for small and large icons.
ja: リストに追加されたアイコンは、大小のアイコンについてシステムの寸法に合わせて自動的に拡大縮小されます。

source: Icons are aligned with the left edge of each fixed-width tab.
ja: アイコンは各固定幅タブの左端に揃えられる。

source: Icons are automatically kept arranged in icon and small icon view.
ja: アイコンは自動的にアイコン・ビューとスモール・アイコン・ビューに配置されます。

source: Icons containing a transparent color automatically allow that color to match any color on the screen.
ja: 透明な色を含むアイコンは、自動的にその色が画面上のどの色とも一致するようになります。

source: Identical to the a format, except that P, rather than p, introduces the exponent.
ja: p ではなく P が指数を示すことを除けば，a形式と同じです。

source: Identical to the e format except that E rather than e introduces the exponent.
ja: eではなくEが指数を導入することを除いて、eフォーマットと同じです。

source: Identical to the g format, except that E, rather than e, introduces the exponent (where appropriate).
ja: g形式と同じ。ただし、e ではなく E が指数（適切な場合）を導入している。

source: If "Str" or "WStr" is used for a parameter, the address of the string is passed to the function.
ja: パラメータに「Str」または「WStr」を使用した場合、文字列のアドレスが関数に渡されます。

source: If #Requires was detected, this is whatever number it specified, excluding "v".
ja: もし#Requiresが検出された場合、「v」を除いた数字が指定される。

source: If - Syntax & Usage | AutoHotkey v2
ja: If - 構文と使用法｜AutoHotkey v2

source: If -1, it never times out (modifier keys are always pushed back down after the Send).
ja: -1のときは、タイムアウトしません。Sendの後、修飾キーは常に押し戻されます。

source: If /Launch is not used, the launcher generally has to assume that its parent process might be doing something like RunWait(PathOfScript), which wouldn't work as expected if the launcher exited before the launched script.
ja: /Launch が使用されていない場合、ランチャーは通常、親プロセスがRunWait(PathOfScript)のようなことを行っているかもしれないと仮定しなければなりません。

source: If 0 (false), attempting to read the variable within an expression would throw an error.
ja: 0 (false)の場合、式の中で変数を読み込もうとするとエラーが発生します。

source: If 0 (false), the window will not be hidden.
ja: 0（false）の場合、ウィンドウは非表示にならない。

source: If 0 is specified as an integer format (i, u, x, X, o, d) and a precision specification is also present - for example, {:04.d} - the 0 is ignored.
ja: 整数形式（i、u、x、o、d）として0が指定され、かつ精度指定がある場合（例：{:04.d}）、0は無視されます。

source: If 0, it always times out (modifier keys are never pushed back down).
ja: 0のときは、常にタイムアウトします。修飾キーが押し戻されることはありません。

source: If 0, it will wait 500 ms.
ja: 0なら500ミリ秒待つ。

source: If A_Index is used in Expression, it contains the index of the iteration which has just finished.
ja: A_Indexが Expressionで使用されている場合、ちょうど終了した反復のインデックスが格納される。

source: If SendMode is used during script startup, it affects all remappings.
ja: スクリプト起動時にSendModeが使用されると、すべてのリマッピングに影響する。

source: If hotkey response time is crucial (such as in games) and the script contains any timers whose functions take longer than about 5 ms to execute, use the following function to avoid any chance of a 15 ms delay.
ja: ゲームなどでホットキーの反応時間が重要で、スクリプトにタイマーが含まれていて、その関数の実行に約5ミリ秒以上かかる場合は、以下の関数を使用して15ミリ秒の遅延を回避してください。

source: If #MaxThreadsBuffer does not appear in the script, its default setting (OFF in this case) will be used.
ja: MaxThreadsBufferがスクリプトに表示されていない場合は、そのデフォルト設定（この場合はOFF）が使用されます。

source: If Try is not used, the unhandled exception causes an error dialog by default.
ja: Tryを使用しない場合、処理されなかった例外はデフォルトでエラーダイアログを表示します。

source: If ( or ) appears in the options of a potential continuation section (other than as part of the Join option), the overall line is not interpreted as the start of a continuation section.
ja: 継続セクションの可能性のあるオプションに（Joinオプションの一部以外として）(または)が現れる場合、全体の行は継続セクションの開始として解釈されません。

source: If +V is set by VK and +S is set by SC (or vice versa), +V takes precedence.
ja: VKで+Vを設定し、SCで+Sを設定した場合（またはその逆）、+Vが優先されます。

source: If MyGui.Destroy() is not used, the window is automatically destroyed when the Gui object is deleted (see General Remarks for details).
ja: MyGui.Destroy()を使用しない場合、Guiオブジェクトが削除されるとウィンドウは自動的に破棄されます（詳細は「一般備考」を参照）。

source: If SendMode "Play" is called during script startup, all remapped keys are affected and might lose some of their functionality.
ja: スクリプト起動時にSendMode "Play"が呼び出されると、すべてのリマップキーが影響を受け、機能の一部が失われる可能性があります。

source: If static __New is not intended to act on derived classes, that can be avoided by checking the value of this.
ja: static __Newが派生クラスに対して作用することを意図していない場合は、thisの値をチェックすることで回避できる。

source: If try is used without finally or catch, it acts as though it has a catch with an empty block.
ja: tryが finallyや catchなしで使われた場合、空のブロックでcatchがあるかのように動作します。

source: If MaxParams is 1 for get or 2 for set and IsVariadic is false or undefined, the property cannot accept parameters; they are instead forwarded to the __Item property of the object returned by get.
ja: MaxParamsがgetが 1、setが 2 で、IsVariadicが false または undefined の場合、このプロパティはパラメータを受け取ることができません; これらは、代わりに get によって返されたオブジェクトの __Item プロパティに転送されます。

source: If extends BaseClassName is present, BaseClassName must be the full name of another class.
ja: extends BaseClassNameがある場合、BaseClassNameは他のクラスの完全な名前でなければならない。

source: If *w and *h are omitted, the image will be scaled to fit the current size of the control.
ja: *wと*hが省略された場合、画像はコントロールの現在のサイズに合うように拡大縮小されます。

source: If ^!b is a hook hotkey, you can define ^!a as a hotkey if you want Ctrl+Alt+A to perform the same action as Ctrl+Alt+B.
ja: ^!bがフックホットキーである場合、Ctrl+Alt+AでCtrl+Alt+Bと同じ動作をさせたい場合は、^!aをホットキーとして定義できます。

source: If Action is a function, it is called with one parameter, the name of the hotkey.
ja: Actionが関数の場合、1つのパラメータ（ホットキーの名前）で呼び出されます。

source: If Action is a hotkey name, its original function is used; specifically, the original function of the hotkey variant corresponding to the current HotIf criteria.
ja: Actionがホットキー名の場合、その元の機能が使用されます。具体的には、現在のHotIf基準に対応するホットキーバリアントの元の機能が使用されます。

source: If ClipboardAll cannot retrieve one or more of the data objects (formats) on the clipboard, they will be omitted but all the remaining objects will be stored.
ja: ClipboardAllがクリップボード上の1つ以上のデータオブジェクト（フォーマット）を取得できない場合、それらは省略されますが、残りのオブジェクトはすべて保存されます。

source: If Component is omitted, IMMDevice::Activate is called to retrieve the interface.
ja: Componentが省略された場合は、IMMDevice::Activateが呼び出されてインターフェースを取得します。

source: If Count is enclosed in parentheses, a space or tab is not required.
ja: Countが括弧で囲まれている場合、スペースやタブは必要ありません。

source: If Count is specified, changing A_Index affects the number of iterations that will be performed.
ja: Countが指定されている場合、A_Indexを変更すると、実行される反復処理の回数に影響します。

source: If DateTime1 is earlier than DateTime2, the result is a negative number.
ja: DateTime1がDateTime2よりも早い場合、結果は負数になります。

source: If DateTime contains an invalid timestamp or a year prior to 1601, a ValueError is thrown.
ja: DateTimeに無効なタイムスタンプや1601年より前の年が含まれる場合、ValueErrorがスローされます。。

source: If DelimiterChars is blank, OmitChars indicates which characters should be excluded from consideration (the loop will not see them).
ja: DelimiterCharsが空白の場合、OmitCharsは考慮から除外されるべき文字を示します（ループはそれらを見ません）。

source: If Delimiters is blank, OmitChars indicates which characters should be excluded from consideration (the loop will not see them).
ja: Delimitersが空白の場合、OmitCharsは考慮から除外されるべき文字を示します（ループはそれらを見ません）。

source: If Delimiters is blank, OmitChars indicates which characters should be excluded from the array.
ja: Delimitersが空白の場合、OmitCharsは配列から除外すべき文字を示す。

source: If DestinationKey is meant to be {, it has to be escaped, for example, x::`{.
ja: DestinationKeyが {の場合は、x::`{のようにエスケープしなければならない。

source: If EventObj is specified, OnEvent, OnNotify and OnCommand can be used to register methods of EventObj to be called when an event is raised.
ja: EventObjを指定した場合、OnEvent、OnNotify、OnCommandを使用して、イベントが発生したときに呼び出されるEventObjのメソッドを登録することができる。

source: If FilePattern contains a relative path rather than an absolute path, the path here will also be relative.
ja: FilePatternに絶対パスではなく相対パスが含まれている場合、ここでのパスも相対パスとなります。

source: If Force is false, an internal variable is updated to indicate whether the hook is required by the script, but there might be no immediate change if the hook is required for some other purpose.
ja: Forceがfalseの場合、フックがスクリプトで必要とされているかどうかを示す内部変数が更新されますが、フックが他の目的で必要とされている場合は、すぐに変化がない場合があります。

source: If Force is true and Install is false, the hook is uninstalled even if needed for some other purpose.
ja: ForceがtrueでInstallがfalseの場合、フックは他の用途で必要であってもアンインストールされます。

source: If Force is true and Install is omitted or true, the hook is uninstalled and reinstalled.
ja: ForceがtrueでInstallが省略またはtrueの場合、フックのアンインストールと再インストールが行われる。

source: If Format contains date and time elements together, they must not be intermixed.
ja: Formatが日付と時刻の要素を一緒に含む場合、両者を混在させてはならない。

source: If Format contains more than 2000 characters, an empty string is returned.
ja: Formatが2000文字以上の場合は、空文字列を返します。

source: If Function is omitted, SetTimer will operate on the timer which launched the current thread, if any.
ja: Functionが省略された場合、SetTimerは現在のスレッドを起動したタイマーを操作します（もしあれば）。

source: If Function is omitted, the default RegEx callout function named pcre_callout must be defined.
ja: Functionが省略された場合、pcre_calloutというデフォルトのRegExコールアウト関数が定義されなければなりません。

source: If InfoType is "Class" or "CLSID", type information is retrieved via the IProvideClassInfo::GetClassInfo interface method.
ja: InfoTypeが"Class"または"CLSID"の場合、型情報はIProvideClassInfo::GetClassInfoインタフェースメソッドにより取得されます。

source: If InfoType is "Name" or "IID", type information is retrieved via the IDispatch::GetTypeInfo interface method.
ja: InfoTypeが"Name"または"IID"の場合、IDispatch::GetTypeInfoインタフェースメソッドにより型情報を取得します。

source: If KeyName already exists as a hotkey, that hotkey will be updated with the values of the function's other parameters.
ja: KeyNameがすでにホットキーとして存在する場合、そのホットキーは、関数の他のパラメータの値で更新されます。

source: If KeyName corresponds to a scan code or single character, the function attempts to map the value to a virtual key code by calling certain system functions which refer to the script's current keyboard layout.
ja: KeyNameがスキャンコードまたは1文字に対応する場合、この関数は、スクリプトの現在のキーボードレイアウトを参照する特定のシステム関数を呼び出して、値を仮想キーコードにマッピングしようとします。

source: If KeyName corresponds to a virtual key code or single character, the function attempts to map the value to a scan code by calling certain system functions which refer to the script's current keyboard layout.
ja: KeyNameが仮想キーコードまたは1文字に対応する場合、この関数は、スクリプトの現在のキーボードレイアウトを参照する特定のシステム関数を呼び出して、値をスキャンコードにマッピングしようとします。

source: If KeyName is an ASCII letter in the range A-Z and has no mapping within the keyboard layout, the corresponding virtual key in the range vk41-vk5A is used as a fallback.
ja: KeyNameがA-Zの範囲のASCII文字で、キーボードレイアウト内にマッピングがない場合、vk41-vk5Aの範囲の対応する仮想キーが予備として使用されます。

source: If KeyName specifies a subkey which does not exist, RegWrite attempts to create it (along with its ancestors, if necessary).
ja: KeyNameが存在しないサブキーを指定した場合、RegWriteはそれを作成しようとします（必要であれば、その祖先も一緒に）。

source: If KeyName specifies an existing registry key, RegCreateKey verifies that the script has write access to the key, but makes no changes.
ja: KeyNameが既存のレジストリキーを指定した場合、RegCreateKeyはスクリプトがキーへの書き込みアクセス権を持っているかどうかを確認しますが、変更は行いません。

source: If Length is negative, its absolute value indicates the exact number of characters to convert, including any binary zeros that the string might contain - in other words, the result is always a string of exactly that length.
ja: Lengthが負の場合、その絶対値は、文字列に含まれる可能性のある2進数のゼロを含め、変換する文字数を正確に示します。

source: If Length is omitted, the removed value is returned (blank if none).
ja: Lengthが省略された場合は、削除された値が返される（ない場合は空白）。

source: If Length is zero or less than the projected length after conversion (or the length of the source string if conversion is not required), an exception is thrown.
ja: Lengthがゼロか、変換後の投影長（変換が不要な場合はソース文字列の長さ）より小さい場合、例外がスローされる。

source: If Limit is omitted, it defaults to -1, which replaces all occurrences of the pattern found in Haystack.
ja: Limitが省略された場合、デフォルトは -1 で、Haystackで見つかったパターンのすべての出現回数を置き換えます。

source: If LowLevelHooksTimeout is not defined, the default timeout is 300ms.
ja: LowLevelHooksTimeoutが定義されていない場合、デフォルトのタイムアウトは 300ms です。

source: If LowLevelHooksTimeout is not defined, the default timeout is 300 ms.
ja: LowLevelHooksTimeoutが指定されていないときはタイムアウトの初期値は300ミリ秒です。

source: If MenuItemName does not yet exist, it will be added to the menu.
ja: MenuItemNameがまだ存在しない場合、メニューに追加されます。

source: If MenuItemName is an empty string, there will be no default.
ja: MenuItemNameが空文字列の場合、デフォルトは存在しない。

source: If MenuItemName is omitted, all items are deleted from the menu, leaving the menu empty.
ja: MenuItemNameが省略された場合、すべての項目がメニューから削除され、メニューは空っぽになる。

source: If MinSize and MaxSize are never used, the operating system's defaults are used (similarly, MyGui.Opt("-MinSize -MaxSize") can be used to return to the defaults).
ja: MinSizeと MaxSizeが一度も使われていない場合、オペレーティングシステムのデフォルトが使われます（同様に、MyGui.Opt("-MinSize -MaxSize")でデフォルトに戻ることができます）。

source: If My Folder does not exist, the first example above will use "My Folder" as the target filename, while the second example will copy no files.
ja: My Folderが存在しない場合、上記の最初の例ではターゲットファイル名として「My Folder」が使用され、2番目の例ではファイルはコピーされません。

source: If My Folder does not exist, the first example above will use "My Folder" as the target filename, while the second example will move no files.
ja: My Folderが存在しない場合、上記の最初の例ではターゲットファイル名として「My Folder」が使用され、2番目の例ではファイルは移動しません。

source: If N is negative, Number is rounded by N digits to the left of the decimal point:
ja: Nが負の場合、Numberは小数点以下N桁で四捨五入されます：

source: If N is omitted or 0, Number is rounded to the nearest integer:
ja: Nが省略された場合、または 0 の場合、Numberは最も近い整数に丸められます：

source: If N is positive number, Number is rounded to N decimal places:
ja: Nが正の数の場合、Numberは小数点以下N桁に丸められます：

source: If Number is 0, the return value is a string containing a binary null character, not an empty (zero-length) string.
ja: Numberが 0 の場合、戻り値は、空の（長さゼロの）文字列ではなく、2 進数のヌル文字を含む文字列です。

source: If Number is less than -1 or greater than 1, a ValueError is thrown.
ja: Numberが -1 より小さいか 1 より大きい場合、ValueErrorが投げられます。

source: If Number is negative, a ValueError is thrown.
ja: Numberが負の場合、ValueErrorが投げられる。
